<?
echo "<h3>Задание №4</h3>";
echo "<p><b>Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).</b><br>Написать функцию транслитерации строк.</p>";
echo "<h4>Ответ</h4>";
function translit($text){
$letter= [
    'а'=> 'a','б'=> 'b','в'=> 'v',
    'г'=> 'g','д'=> 'd', 'е'=> 'e',
    'ё'=> 'е', 'ж'=> 'zh', 'з'=> 'z',
    'и'=> 'i', 'й'=> 'i','к'=> 'k',
    'л'=> 'l', 'м'=> 'm', 'н'=> 'n',
    'о'=> 'o', 'п'=> 'p', 'р'=> 'r',
    'с'=> 's', 'т'=> 't', 'у'=> 'u',
    'ф'=> 'f', 'х'=> 'kh', 'ц'=> 'tc',
    'ч'=> 'ch', 'ш'=> 'sh', 'щ'=> 'shch',
    'ъ'=> '', 'ы'=> 'y', 'ь'=> '',
    'э'=> 'e', 'ю'=> 'iu', 'я'=> 'ia'
        ];
    return strtr($text, $letter);
    }
echo translit('произвольный текст');


